{"dataset_name": "/user/hm74/NYCOpenData/5jat-czce.tsv.gz", "columns": [{"column_name": "ACC", "number_non_empty_cells": 2873, "number_empty_cells": 21, "number_distinct_values": 2772, "frequent_values": ["30094", "CHAPTER #660, LAWS OF 1893.\"", "(NO CARD ON FILE) D. Timothy\"", "(CHAPTER #410, LAWS OF 1882)", "(CHAPTER 3378, LAWS OF 1897).\""], "dataTypes": [{"type": "INTEGER (LONG)", "count": 2500, "max_value": 30240, "min_value": 1, "mean": 20007.02319999999, "stddev": 11079.729692346353}, {"type": "DATE/TIME", "count": 1, "max_value": "2019-12-08T04:00:00", "min_value": "2019-12-08T04:00:00"}, {"type": "TEXT", "count": 393, "shortest_values": [["-----", 5], ["21265A", 6], ["30077R", 6], ["30108R", 6], ["30201(A)", 8]], "longest_values": [["PLANS AND PROFILES SHOWING MODIFICATIONS OF PLANS AND PROFILES APPROVED BY THE BD. OF E. & A. ON JUNE 19, 1903 AND AS MODIFIED BY THE PLANS AND PROFILES APPROVED ON DECEMBER 4, 1903 OF THE VIADUCTS OR BRIDGES REQUIRED TO CARRY 45TH, 46TH, 47TH, 48TH , & 49TH STREETS AND THE PARK AVENUE EXTENSION OVER THE TRACKS OF THE N.Y. & H.R. CO., AND SHOWING CERTAIN ALTERATIONS OF CHANGES 43RD ST; 44TH STREET; DEPEW PLACE; & VANDERBILT AVENUE; -AND- SHOWING THE LANDS, RIGHTS, INTERESTS AND EASEMENTS IN LANDS OWNED, OCCUPIED OR CONTROLLED BY THE CITY OF NEW YORK REQUIRED FOR THE PURPOSE OF MAKING CERTAIN ALTERATIONS, CHANGES AND ADDITIONS, OTHER THAN THE ALTERATIONS, CHANGES AND ADDITIONS AUTHORIZED BY SECTIONS #1, 2, & 3 OF CHAPTER #425 OF THE LAWS OF 1903 AND SUBMITTED IN DUPLICATE TO THE BOARD OF F. & A. OF THE CITY OF NEW YORK FOR ITS APPROVAL ON DECEMBER 23, 1904, PURSUANT TO SAID CHAPTER #425 OF THE LAWS OF 1903, ETC.\"", 925], ["MAP OF THE CITY OF NEW YORK SHOWING THE STREETS, AVENUES, ROADS, PUBLIC SQUARES 7 PLACES AS LAID OUT, ESTABLISHED, WIDENED & RETAINED; THE NEW PIER AND BULKHEAD LINES AS LAID OUT AND ESTABLISHED BY THE BOARD OF COMMISSIONERS OF THE CENTRAL PARK BY AND UNDER AUTHORITY OF CHAPTER #697 OF THE LAWS OF THE STSTE OF NEW YORK, PASSED ON APRIL 24TH, 1867 FROM 8TH AVENUE TO THE HUDSON RIVER AND FROM 59TH STREET TO 155TH STREET (COMPILED FROM OFFICIAL DOCUMENTS). BY OTTO SACKERSDORFF, MAP CLERK AND CITY SURVEYOR.\"", 509], ["MAP SHOWING THE STREET, ROAD OR AVENUE (HAMLIN AVENUE) COMMENCING ON THE EASTERLY LINE OF THE FIRST NEW AVENUE EAST OF 10TH AVENUE OPPOSITE WEST 138TH STREET, AND ENDING ON THE WESTERLY LINE OF ST. NICHOLAS AVENUE OPPOSITE WEST 135TH STREET; BEING THE STREET ROAD OR AVENUE LAID OUT AND UNDER THE AUTHORITY  OF CHAPTER # 587 OF THE LAWS OF 1881 ON MAY 15, 1882, --- AND DISCONTINUED AND CLOSED BY THE BOARD OF STREET OPENING & IMPROVEMENT  UNDER AUTHORITYOF CHAPTER #360, LAWS OF 1883.\"", 486], ["MAP SHOWING A CHANGE IN THE CITY MAP BY ELIMINATING, DISCONTINUING AND CLOSING  EDGECOMBE AVENUE FROM THE EASTERLY PROLONGATION OF NORTHERLY SIDE WEST 169TH STREET TO AMSTERDAM AVENUE, -AND- JUMEL PLACE FROM A POINT 250 FEET NORTH OF WEST 168TH STREET TO EDGECOMBE AVENUE, -AND- BY LAYING OUT A NEW STREET APPROXIMATELY 545 FEET NORTH OF WEST 167TH STREET BETWEEN EDGECOMBE AVENUE AND JUMEL PLACE, ALL IN CONNECTION WITH THE SITE OF INTERMEDIATE SCHOOL #172.\"", 459], ["FINAL DAMAGE MAP IN THE MATTER OF ACQUIRING TITLE FOR THE WIDENING OF THE EAST RIVER DRIVE ON ITS WESTERLY SIDE FROM: EAST 100TH ASTREET TO EAST 102ND STREET; EAST 105TH STREET TO EAST 109TH STREET; EAST 110TH STREET TO A POINT ABOUT 84:64 FEET NORTHERLY THEREFROM; AND FROM EAST 121ST TO EAST 122ND STREET; AND FOR THE PUBLIC PARK LOCATED AT THE SOUTHWEST CORNER OF THE EAST RIVER DRIVE AND EAST 121ST STREET, BOROUGH OF MANHATTAN, CITY OF NEW YORK.\"", 451]], "average_length": 71.66921119592874}]}, {"column_name": "Sheets", "number_non_empty_cells": 2487, "number_empty_cells": 407, "number_distinct_values": 40, "frequent_values": ["1", "2", "3", "6", "4"], "dataTypes": [{"type": "INTEGER (LONG)", "count": 2484, "max_value": 110, "min_value": 0, "mean": 1.93236714975845, "stddev": 4.4681119985274105}, {"type": "TEXT", "count": 3, "shortest_values": [["SET", 3], ["1 [2 COPIES]", 12], ["1 (IN 4 PIECES)", 15]], "longest_values": [["1 (IN 4 PIECES)", 15], ["1 [2 COPIES]", 12], ["SET", 3]], "average_length": 10.0}]}, {"column_name": "CP_Number", "number_non_empty_cells": 127, "number_empty_cells": 2767, "number_distinct_values": 118, "frequent_values": ["NONE", "850112", "860114", "9308", "56926"], "dataTypes": [{"type": "INTEGER (LONG)", "count": 76, "max_value": 990169, "min_value": 0, "mean": 130209.56578947368, "stddev": 294934.13996358827}, {"type": "TEXT", "count": 51, "shortest_values": [["NONE", 4], ["NONE", 4], ["NONE", 4], ["NONE", 4], ["NONE", 4]], "longest_values": [["N 120154 MEM", 12], ["C-     2710", 11], ["D-     1695", 11], ["E-     3273", 11], ["H-    10822", 11]], "average_length": 8.294117647058824}]}, {"column_name": "Map_Year", "number_non_empty_cells": 2390, "number_empty_cells": 504, "number_distinct_values": 206, "frequent_values": [1924, 1912, 1948, 1920, 1949], "dataTypes": [{"type": "INTEGER (LONG)", "count": 2390, "max_value": 2951, "min_value": 1728, "mean": 1923.074895397491, "stddev": 45.19000145699902}]}, {"column_name": "Dimensions", "number_non_empty_cells": 2211, "number_empty_cells": 683, "number_distinct_values": 92, "frequent_values": ["17X26", "26X35", "36X54", "E-1", "12X17"], "dataTypes": [{"type": "INTEGER (LONG)", "count": 8, "max_value": 38, "min_value": 17, "mean": 29.375, "stddev": 9.61687969145918}, {"type": "TEXT", "count": 2203, "shortest_values": [["?", 1], ["?", 1], ["?", 1], ["?", 1], ["?", 1]], "longest_values": [["\"50\"\"X145\"\" (36\"\"x54\"\")\"", 24], ["\"8\"\"X12\"\" & 12\"\"X18\"\"\"", 22], ["\"50\"\"X200\"\" (36X54)\"", 20], ["\"E-1 - BIN 45 \"\"E\"\"\"", 20], ["\"50\"\"X70\"\" (36X54)\"", 19]], "average_length": 4.947798456650024}]}, {"column_name": "Map_Title_and_information", "number_non_empty_cells": 1839, "number_empty_cells": 1055, "number_distinct_values": 2229, "frequent_values": ["NOT FILED", "DAMAGED", "AT MUNICIPAL ARCHIVE", "DAMAGED--tears through margin notes.  Adhesive staining obscures margin notes", "NOT SIGNED BY BOE"], "dataTypes": [{"type": "TEXT", "count": 2392, "shortest_values": [["WORN", 4], ["TORN", 4], ["WORN", 4], ["TORN", 4], ["WORN", 4]], "longest_values": [["DAMAGED - MAP SHOWING A CHANGE IN THE CITY OF MAP BY LAYING OUT THE LINES AND GRADES FOR A STREET DESIGNATED AS THE BATTERY PARK UNDERPASS AND RAMPS THERETO IN, UNDER, AND THROUGH BATTERY PARK FOR A STREET DESIGNATED AS PLAZA UNDERPASS IN AND UNDER THE MANHATTANAPPROACHESTO BROOKLYN-BATTERY TUNNEL, -AND- BY LAYING OUT THE LINES AND GRADES FOR A WIDENING OF MORRIS STRET ON ITS NORTHERLY SIDE BETWEEN WEST STREET AND WASHINGTON STREET, -AND- FOR A WIDENING OF A NEW STREET ON THE NORTHERLY SIDE OF THE MANHATTAN APPROACHES BETWEEN WEST STREET AND WASHINGTON STREET, -AND- BY ELIMINATING OR CHANGING THE LINES OF EDGAR STREET BETWEEN GREENWICH STREET AND TRINITY PLACE, -ALSO- WASHINGTON STREET BETWEEN A NEW STREET AND MORRIS STREET, -AND- SOUTH STREET, WEST OF WHITEHALL STREET TOGETHER WITH A CHANGE IN THE LINES OF BATTERY PARK BETWEEN STATE STREET AND SOUTH STREET.", 870], ["DAMAGED--WILL REQUIRE EXTENSIVE CONSERVATION TO REPAIR - PIERHEAD AND BULKHEAD LINES FRO THE WATERFRONTS OF PART OF THE CITY OF NEW YORK, N.Y., AND FOR THE ADJACENT NEW JERSEY SHORE AS RECOMMENDED BY THE NEW YORK HARBOR LINE BOARD, APPOINTED FOR THE ESTABLISHMENT OF THE HARBOR LINES OF NEW YORK HARBOR AND ITS ADJACENT WATERS BY SPECIAL ORDER NO: #49, HEADQUARTERS, CORPS OF ENGINEERS, U.S.A., OCT. 5TH, 1888, AND BY SUBSEQUENT ORDERS, IN ACCORDANCE WITH SECTION #12, ACT OF AUGUST 11TH, 1888, AS AMENDED AND RE-ENACTED BY SECTION #12, ACT OF SEPTEMBER 19TH, 1890; AND APPROVED BY THE SECRETARY OF WAR.  COMPILED AND DRAWN FROM PUBLISHED CHARTS OF THE U.S. COAST AND GEODETIC SURVEY AND SUPPLEMENTED BY DATA OBTAINED FROM THE PRINTED MARGINAL MAPS OF THE DEPARTMENT OF DOCKS AND FERRIES OF THE CITY OF NEW YORK, N.Y., BY C.G. AUERBACH; MARCH, 1901.", 849], ["TORN (TWO SETS) - N.Y.C. & H.R.R.R. CO. LEASED AND OPERATED LINES OF THE GRAND CENTRAL TERMINAL IMPROVEMENTS OF N.Y.C., SHOWING PLANS AND PROFILES OF PUBLIC STREETS, AVENUES AND PLACES, VIADUCTS AND BRIDGES BETWEEN 42ND STREET AND 59TH STREET & BETWEEN MADISON AVENUE & LEXINGTON AVENUE.  SHOWING CHANGES IN PUBLIC STREETS, AVENUES, AND PLACES.  MODIFYING PLANS & PROFILES HERETOFORE SUBMITTED & APPROVES AND SHOWING LANDS, RIGHTS, INRTERESTS OF EASEMENTS IN LANDS OWNED, OCCUPIED OR CONTROLLED BY THE CITY OF NEW YORKREQUIRED FOR PURPOSED SPECIFIED IN CHAPTER #425 OF THE LAWS OF 1903, AS AMENDED BY CHAPTER #555 OF THE LAWS OF 1910, PREPARED BY THE N.Y.C. & H.R.R.R. CO., & SUBMITTED IN DUPLICATE TO THE BOARD OF ESTIMATE & APPORTIONMENT OF THE CITY OF NEW YORK FOR ITS APPROVAL ON JANUARY 26, 1911 AND APPROVED BY THE SAID BOARD ON JUNE 15, 1911.", 849], ["MAP SHOWING A CHANGE IN THE STREET SYSTEM BY ELIMINATING  FROM THE CITY MAP THE LINES OF WEST 226TH AND WEST 227TH STREETS BETWEEN BROADWAY, BOROUGH OF MANHATTAN, AND EXTERIOR STREET, BOROUGH OF THE BRONX, -AND- BY WIDENING BROADWAY ON ITS EASTERLY SIDE BETWEEN WEST 225TH STREET AND APPROXIMATELY 130 FEET NORTH OF WEST 227TH STREET, AND ON ITS WESTERLY SIDE BETWEEN WEST 228TH STREET AND WEST 230TH STREET, AND WEST 228TH STREET ON ITS NORTHERLY SIDE BETWEEN BROADWAY AND MARBLE HILL AVENUE, AND MARBLE HILL AVENUE ON ITS EASTERLY SIDE BETWEEN WEST 228TH STREET, BOROUGH OF MANHATTAN, AND WEST 230TH STREET, BOROUGH OF THE BRONX , AND EXTERIOR STREET ON ITS WESTERLY SIDE, BOROUGH OF THE BRONX BETWEEN WET 225TH STREET AND WEST 230TH STREET, AND BY ESTABLISHING GRADES FOR THE WIDENED STREETS AND LAYING OUT A PARK WITHIN THE HOUSING SITE.", 841], ["\"MAP SHOWING A CHANGE IN THE STREET SYSTEM BY ELIMINATING FROM THE CITY MAP THE LINES OF EAST 15TH STREET BETWEEN FIRST AVENUE AND AVENUE C, EAST 16TH STREET BETWEEN FIRST AVE AND AVE C, EAST 17TH STREET BETWEEN FIRST AVE AND AVE C, EAST 18TH STREET BETWEEN FIRST AVEAND MARGINAL STREET.  EAST 19TH STREET---BETWEEN FIRST AVENUE AND MARGINAL STREET. AVENUE \"\"A\"\" BETWEEN EAST 14TH STREET AND EAST 20TH STREET. AND BY WIDENING: FIRST AVENUE ----EAST 14TH STREET TO EAST 20TH STREET. (EASTERLY SIDE).  EAST 20TH STREET---FIRST AVENUE TO MARGINAL STREET. (SOUTHERLY SIDE).  AVENUE \"\"C\"\"----EAST 14TH STREET TO MARGINAL STREET (WESTERLY SIDE).  EAST 14TH STREET----FIRST AVENUE TO AVENUE \"\"C\"\". (NORTHERLY SIDE) AND BY LAYING OUT THE LINES OS A NEW STREET, ADJACENT TO AND PARALLEL WITH MARGINAL STREET FORM AVENUE \"\"C\"\" TO EAST 20TH STREET.\"", 838]], "average_length": 203.07734113712368}]}]}